app/controllers/line_items_controller.rb

  def index
    @line_item = LineItem.all
---
SELECT "line_items".* FROM "line_items"

  def create
      @cart = current_cart
          product = Product.find(params[:product_id])
          @line_item = @cart.line_items.build(:product => product)


        respond_to do |format|
        if @line_item.save
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? ORDER BY title LIMIT 1  [["id", "9"]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Mon, 26 Dec 2011 20:31:26 UTC +00:00], ["updated_at", Mon, 26 Dec 2011 20:31:26 UTC +00:00]]
INSERT INTO "line_items" ("cart_id", "created_at", "product_id", "quantity", "updated_at") VALUES (?, ?, ?, ?, ?)  [["cart_id", 3], ["created_at", Mon, 26 Dec 2011 23:36:06 UTC +00:00], ["product_id", 9], ["quantity", 1], ["updated_at", Mon, 26 Dec 2011 23:36:06 UTC +00:00]]